Repository: Open-Plant/OpenPlantOPC
Catalog: OPCFoundation Classic/XML Wrapper/Resources/Strings.*.resx
Languages: fr

# E_FAIL
source: Unspecified error.
fr: Erreur non specifiee.

# E_OUTOFMEMORY
source: Ran out of memory.
fr: Depassement des capacites memoire.

# E_SERVERSTATE
source: The operation could not complete due to an abnormal server state.
fr: L'operation ne peut pas etre execute a cause d'un etat anormal dans le serveur.

# E_TIMEDOUT
source: The operation took too long to complete (determined by server).
fr: L'operation a pris trop longtemps pour s'executer. (Selon le serveur)

# E_BUSY
source: The server is currenly processing another polled refresh for one or more of the subscriptions.
fr: Le serveur traite d'autres demandes de rafraichissement, pour un ou plusieurs autres abonnement.

# E_NOSUBSCRIPTION
source: No subscription handles were specified in the request.
fr: Aucun n? d'abonnement n'est specificie dans la requete.

# E_INVALIDHOLDTIME
source: The hold time is too long (determined by server).
fr: Le temps d'attente est trop long (Selon le serveur).

# E_INVALIDCONTINUATIONPOINT
source: The continuation point is not valid.
fr: Les points de suite ne sont pas valides.

# E_INVALIDFILTER
source: The filter string is not valid.
fr: Le filtre est invalide.

# E_UNKNOWN_ITEM_NAME
source: The item name is no longer available in the server address space.
fr: Le nom de l'item n'est pas valide dans l'espace d'adressage du serveur.

# E_INVALID_ITEM_NAME
source: The item name does not conform the server’s syntax.
fr: Le nom de l'item ne respecte pas la syntaxe du serveur.

# E_UNKNOWN_ITEM_PATH
source: The item path is no longer available in the server address space.
fr: Le chemin d'acces de l'item n'est pas valide dans l'espace d'adressage du serveur.

# E_INVALID_ITEM_PATH
source: The item path does not conform the server’s syntax.
fr: Le chemin d'acces de l'item ne respecte pas la syntaxe du serveur.

# E_BADTYPE
source: The server cannot convert the data between the requested data type and the canonical data type.
fr: Le serveur ne peut pas convertir les donnees entre le type requit et le type canonique.

# E_RANGE
source: The value was out of range.
fr: La valeur est en dehors des plages.

# E_READONLY
source: The value is read only and may not be written to.
fr: La valeur est en lecture seule.

# E_WRITEONLY
source: The value is write only and may not be read from or returned as part of a write response.
fr: La valeur est en ecriture seule.

# E_NOTSUPPORTED
source: The server does not support writing to the quality and/or timestamp.
fr: Le serveur ne supporte pas l'ecriture de la qualite et/ou de l'horodate.

# E_INVALID_PID
source: The property id is not valid for the item.
fr: L'identificateur de propriete n'est pas valide pour cet item.

# S_CLAMP
source: The value written was accepted but the output was clamped.
fr: La demande d'ecriture a ete accepte mais la valeur de sortie a ete ajuste.

# S_UNSUPPORTEDRATE
source: The server does not support the requested rate but will use the closest available rate.
fr: Le serveur ne supporte pas la frequence demande, la valeur compatible la plus proche sera utilisee.

# S_DATAQUEUEOVERFLOW
source: Not every detected change has been returned since the server's buffer reached its limit and had to purge out the oldest data.
fr: Tous les changements d'etat n'ont pas ete retourne depuis que le tampon du serveur a ete sature, les donnees les plus vielles ont ete purge.
